src/test/resources/rules/request_2.xml

<env:Envelope
	xmlns:env="http://www.w3.org/2003/05/soap-envelope">
	<env:Header />
	<env:Body>
		<ns2:OtaVehAvailRate
			xmlns="http://www.opentravel.org/OTA/2003/05"
			xmlns:ns2="http://www.unidas.com.br/">
			<OTA_VehAvailRateRQ Version="3.000">
				<POS>
					<Source>
						<RequestorID>
							<CompanyName Code="19261" />
						</RequestorID>
					</Source>
				</POS>
				<VehAvailRQCore>
					<VehRentalCore
						PickUpDateTime="2019-01-21T12:00:00.000"
						ReturnDateTime="2019-01-25T16:00:00.000">
						<PickUpLocation LocationCode="SSA2" />
						<ReturnLocation LocationCode="SSA2" />
					</VehRentalCore>
					<VehPrefs>
						<VehPref Code="CDMR" />
					</VehPrefs>
					<DriverType Age="35" />
					<SpecialEquipPrefs>
						<SpecialEquipPref EquipType="13" Quantity="1" />
					</SpecialEquipPrefs>
				</VehAvailRQCore>
				<VehAvailRQInfo>
					<CoveragePrefs>
						<CoveragePref CoverageType="ALL"
							PreferLevelField="Only" />
					</CoveragePrefs>
				</VehAvailRQInfo>
			</OTA_VehAvailRateRQ>
		</ns2:OtaVehAvailRate>
	</env:Body>
</env:Envelope>
